# Friction Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipePressureDropData..::..Friction Property
PipePressureDropData Class See Also
---
The friction of the pipe. Units: (kg/(ft²·s²)).
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double Friction { get; set; }
```

Visual Basic
---
```text
Public Property Friction As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Friction {
	double get ();
	void set (double value);
}
```

# See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace